// 添加新产品需要69开头的码，成本价，规格型号
// Code:商品编码
// GoodsId:货品ID
var productCorrespond = {
    HAPE40LCHJM: { Barcode: '6943478014411', Code: '582437030867', GoodsId: '582439414629' }, //德国hape积木玩具进口榉木40粒益智积木早教益智拼搭拼插玩具	
    HAPE60KYZJM: { Barcode: '6943478020023', Code: '583339787045', GoodsId: '583205630479' }, //hape积木进口益智玩具木制积木60粒装益智早教亲子互动3-8周岁	
    HAPE80LJMTZ: { Barcode: '6943478022515', Code: '611492292778', GoodsId: '583035792234' }, //hape积木益智玩具木头木制80粒早教益智亲子互动3-4-5-6-7男女	
    KLYCQZT24STGZ: { Barcode: '6950164806571', Code: '611492300742', GoodsId: '581526565920' }, //卡乐优亲子早教益智超轻粘土24色糖果装手工diy环保无毒彩泥玩具	
    KLYCQZT100GBCZHS: { Barcode: '6950164804805', Code: '', GoodsId: '582296115810' }, //卡乐优早教玩具益智亲子互动超轻黏土100g超大安全无毒彩泥儿童	
    KLYCQZT100GLSBCZ: { Barcode: '6950164804850', Code: '582161678681', GoodsId: '582162538436' }, //卡乐优早教玩具益智亲子互动超轻黏土100g超大安全无毒彩泥儿童	
    KLYCQZT100GHSBCZ: { Barcode: '6950164804836', Code: '', GoodsId: '582296199361' }, //卡乐优早教玩具益智亲子互动超轻黏土100g超大安全无毒彩泥儿童	
    KLYCQZT24SLSSNH: { Barcode: '6950164802627', Code: '611761849229', GoodsId: '581972905723' }, //卡乐优早教益智安全超轻粘土24色收纳盒装幼儿园推荐日本进口原料	
    KLY8SSZH: { Barcode: '6950164806366', Code: '581899976549', GoodsId: '582096593424' }, //卡乐优儿童颜料早教益智手指画宝宝涂鸦套装手印画安全无毒可水洗	
    CRYPZDB: { Barcode: '6972267561881', Code: '589700131786', GoodsId: '589174844094' }, //MZHA震动棒成人用品自慰器女用高潮性工具按摩棒情趣玩具阴蒂刺激	
    CRYPFJBFS: { Barcode: '6972267563113', Code: '', GoodsId: '590969391215' }, //MZHA成人用品男用飞机杯自慰杯手动撸管神器情趣用性工具	
    HAPESTWJ: { Barcode: 'SUIT0079', Code: '591538781110', GoodsId: '591857787059' }, //hape沙滩玩具桶 铲子套装9件套1-2-3-4-5-6岁儿童沙漏组合男女孩	
    CRYPFJBZS: { Barcode: '6972267565285', Code: '590928187562', GoodsId: '590394024044' }, //MZHA成人用品男用手动飞机杯撸管神器情趣用品性工具锻炼成人	
    HAPE50LJMPZWJ: { Barcode: '6943478019263', Code: '592157763291', GoodsId: '591579424581' }, //hape积木拼装玩具50粒礼盒装1岁23456岁幼儿益智积木交通场景数字	
    KLYCQZTCNTZWJ: { Barcode: '6950164808711', Code: '612245123153', GoodsId: '594361061133' }, //"【超定制】卡乐优益智亲子互动早教超轻粘土无毒儿童彩泥套装玩具"
    KLYLJFLWJ: { Barcode: '6950164809688', Code: '614205966116', GoodsId: '600750140034' }, //"卡乐优游戏道具儿童益智早教亲子玩具卡脑力大作战分类桌面拉圾筒"
    HAPEDMNGPETDKJMPD: { Barcode: '6943478023925', Code: '614205742356', GoodsId: '604014421084' }, //"德国Hape多米诺骨牌儿童大块积木拼搭创意机关宝宝智力益智玩具"
    HAPEBPTXSH: { Barcode: '6943478018587', Code: '603752472107', GoodsId: '603753588141' }, //Hape拼插板拼图丁种蘑菇百变像素画插珠儿童益智玩具逻辑兴趣艺术
    KLYETLB12S: { Barcode: '6950164801224', Code: '605462763042', GoodsId: '605463419498' }, //"卡乐优儿童蜡笔12色水溶性安全无毒小滑环保可水洗旋转炫彩油画棒	"
    KLYETLB24S: { Barcode: '6950164801194', Code: '604831464007', GoodsId: '604830096973' }, //"卡乐优儿童蜡笔24色丝滑油画棒水溶性炫彩棒安全环保可水洗蜡笔	"
    HAPEQMCZT: { Barcode: '6943478013131', Code: '521605286189', GoodsId: '521544761635' }, //【天猫超市】德国Hape奇妙串珠套 儿童玩具宝宝启蒙智力益智积木	
    HAPEGQHCGDYLJM: { Barcode: '6943478021747', Code: '612756938317', GoodsId: '612998659303' }, //德国hape早教益智男女孩钢琴火车轨道音乐积木生日礼物婴幼儿玩具	
    HAPEJM65LNCXZCB: { Barcode: '6943478016316', Code: '612225456413', GoodsId: '612499265257' }, //德国hape拼搭拼装积木早教益智65粒农场小镇城堡123岁男女孩玩具	
    KLYZT100GBCZ: { Barcode: '6950164809909', Code: '612931233625', GoodsId: '612931221970' }, //卡乐优超轻粘土橡皮泥无毒太空水晶彩泥儿童手工di100g大包装套装	
    HAPESTWJWSCXSL11JT: { Barcode: 'suit00265', Code: '613591826949', GoodsId: '613073500565' }, //德国hape沙滩玩具挖沙铲雪沙漏11件套礼盒袋男女孩儿童礼物工具
    HAPETCETHBCSHY: { Barcode: '6943478030725', Code: '617835886848', GoodsId: '617578549947' }, //德国hape童车儿童滑板车三合一1-6岁宝宝可坐溜溜车小孩平衡车
    HAPEHSSLWSXZWJ: { Barcode: '20200428', Code: '617360114905', GoodsId: '617617663153' }, //德国hape花式水漏玩水洗澡玩具123宝宝男女孩戏水婴幼洗澡玩具
    KLYCQZT8SDGGBCZ: { Barcode: '6950164804867', Code: '616193777169', GoodsId: '616703183359' }, //卡乐优超轻粘土8色大规格补充装彩泥橡皮泥黏土diy手工制作大包装
    HAPEETXZYYEBBYSXSWJ: { Barcode: 'suit00266', Code: '617191146259', GoodsId: '617191670402' }, //德国hape儿童洗澡婴幼儿宝宝浴室戏水玩具泰迪鲸鱼男女孩玩偶套装
    HAPEETETDDLJMPHWJ: { Barcode: '6943478030879', Code: '619592978104', GoodsId: '619593522436' }, //德国hape儿童儿童叠叠乐积木平衡玩具男女孩早教益智亲子互动礼物
    HAPEGXHLC: { Barcode: '6943478025318', Code: '624883599304', GoodsId: '624005216241' }, //德国惯性回力车滑行车儿童益智男女孩发条木制模型玩具
    LFCQZTCNKLZT: { Barcode: '6939219081576', Code: '624677134176', GoodsId: '624082984994' }, //罗弗超轻粘土彩泥无毒恐龙主题玩具diy手办工黏土儿童益智套装

    KLYCQZTCDBCZ24S: { Barcode: '6950164805383', Code: '624874149108', GoodsId: '625449575053' }, //卡乐优超轻粘土儿童彩泥橡皮泥超大补充装24色无毒安全
    LFCQZTDIYSBGNTETYZTZ: { Barcode: '6939219070501', Code: '624324857591', GoodsId: '624325737577' }, //罗弗超轻粘土橡皮泥无毒彩泥儿童粘土diy手办工黏土儿童益智套装
    LFCQZTTPWZTYZBSL: { Barcode: '6939219011245', Code: '624083272806', GoodsId: '624394761288' }, //罗弗超轻粘土手工diy无毒彩橡皮泥儿童粘土甜品屋主题益智伴手礼

    KLYTKSWDMLSC: { Barcode: '6950164809251', Code: '625889565440', GoodsId: '626179706056' }, //卡乐优太空沙儿童安全无毒魔力沙彩沙室内女孩桌子沙子套装玩具

    HAPE13JETWJDZXGQ: { Barcode: '694347803037', Code: '624697770282', GoodsId: '624103580452' }, //德国Hape13键小儿童钢琴玩具电子可弹奏男女孩电子琴木制益智玩具

    HAPEETXGHJXHB: { Barcode: '6943478029910', Code: '624597647653', GoodsId: '623724504848' }, //德国hape儿童小狗画架小黑板可升降双面画板家用涂鸦绘画写字白板

    LFCQZT12SWDETCN: { Barcode: '6939219012402', Code: '627945189659', GoodsId: '628538695252' }, //罗弗超轻粘土12色无毒儿童彩泥橡皮泥男女孩手工泥diy益智玩具泥 sc524
    LFCQZTSNHWDET24SNT: { Barcode: '6939219080937', Code: '626518626544', GoodsId: '626807179228' }, //罗弗超轻粘土收纳盒无毒儿童24色黏土手办diy工具包太空沙橡皮泥 sc8093

    LFZTCQZTCQZT24S: { Barcode: '6939219070587', Code: '630321753228', GoodsId: '629984864574' }, //罗弗粘土/超轻粘土超轻粘土24色儿童diy手工制作亲子互动礼盒套装

    HAPEETXBWJTLEY: { Barcode: '6943478006355', Code: '632324107574', GoodsId: '631710649738' }, //Hape儿童学步玩具拖拉鳄鱼1岁婴幼儿宝宝全身会摇摆木质手拉玩具


    LFCQZTSESXZT: { Barcode: '6939219070181', Code: '631366620833', GoodsId: '632329435518' }, //罗弗超轻粘土无毒儿童手工黏土diy材料包十二生肖主题礼盒套装
    LFCQZTXX18S: { Barcode: '6939219070334', Code: '632231346660', GoodsId: '631922933757' }, //罗弗超轻粘土小熊18色儿童幼儿园宝宝diy创意手工无毒橡皮泥礼盒

    HAPEYZPCPDJMETSDLW20LJZ: { Barcode: '6943478020016', Code: '633525263279', GoodsId: '632548904082' }, //德国Hape益智拼插拼搭积木儿童圣诞礼物20粒建筑123岁

    KLYCQZTETWJ24SCNDIY: { Barcode: '6950164804478', Code: '634646018470', GoodsId: '634329309691' }, //卡乐优超轻粘土儿童玩具24色彩泥diy手工橡皮泥宝宝小孩黏土送礼

    LFCQNTCJFX: { Barcode: '6939219062193', Code: '635313519100', GoodsId: '634317824455' }, //薇娅推荐罗弗超轻黏土超级飞侠12盒*30g儿童彩泥黏土手工diy材料

    HAPEYZJMMZPTPCPDWJ: { Barcode: '2405952800049', Code: '634222544822', GoodsId: '634230560250' }, //Hape益智积木木质拼图拼插配对玩具1~3岁宝宝时间认知儿童早教
    HAPEYZRJFDJMKKYYYEYJ: { Barcode: '6943478018549', Code: '634346421158', GoodsId: '634664306850' }, //德国Hape益智软胶浮雕积木可啃咬婴幼儿牙胶6面早教

    LFCQNTMCXFDQLK1230GETCN: { Barcode: '6939219011313', Code: '636340343557', GoodsId: '635336108484' }, //罗弗超轻黏土萌宠小分队巧乐卡12*30g儿童彩泥黏土手工diy材料

    DGHAPECSCZJM: { Barcode: '6943478031012', Code: '638403763295', GoodsId: '637257616452' }, //德国hape穿绳串珠积木儿童益智珠子丛林火车幼儿1-2-3-4-5岁玩具 1盒
    
    KLYTKSNHNHETWJYYESTCNDIY:{Barcode: '6950164806038', Code: '638289215575', GoodsId: '637949070531' }, //卡乐优太空沙男孩女孩儿童玩具婴幼儿沙滩彩泥diy 1袋

    HAPEDDQDDLQWYHDTCHTQ:{Barcode: '6943478024953', Code: '638055852830', GoodsId: '638690866861' }, //Hape叠叠圈堆堆乐青蛙圆环堆塔彩虹套圈宝宝不倒翁益智儿童玩具 1套

    HAPECXXPSTXZWJ:{Barcode: 'SUIT003509', Code: '639761123728', GoodsId: '638686046789' }, //hape春夏新品沙滩洗澡玩具2-3-4-5-6-7-8岁儿童沙漏组套男孩礼物 1套

    HAPEYLHTHYMYMKF:{Barcode: '6943478019027', Code: '640494432413', GoodsId: '640875886478' }, //Hape音乐话筒回音鸣音麦克风儿童唱歌玩具 1个

    KLYDIYGJJSNSTWJSZSP:{Barcode: '6950164809565', Code: '642267728842', GoodsId: '642634665072' }, // 卡乐优diy过家家室内沙滩玩具沙子沙盘4斤彩沙套装太空沙六一礼物
    HAPEWHYYXHRZBBXCZQQYL:{Barcode: '6943478019270', Code: '641919784536', GoodsId: '641897940039' }, // Hape五合一游戏盒绕珠百宝箱串珠敲琴音乐宝宝益智玩具儿童节礼物

    HAPEYLWJYYEMZLQ18JXGQ:{Barcode: '6943478008878', Code: '642367341246', GoodsId: '641978484388' }, // 德国hape音乐玩具婴幼儿木制乐器18键小钢琴早教启蒙1台儿童礼物

    KLYCQZT24SXLX:{Barcode: '6950164811247', Code: '651514782496', GoodsId: '650190360323' }, // 卡乐优超轻粘土24色小蓝箱儿童手工彩泥幼儿园黏土diy软泥1箱
    
};

var productSPirce = {
    P6943478014411: 52,
    P6943478020023: 62,
    P6943478022515: 88,
    P6950164806571: 6.1,
    P6950164804805: 3,
    P6950164804850: 3,
    P6950164804836: 3,
    P6950164802627: 31.39,
    P6950164806366: 34,
    P6972267561881: 30,
    P6972267563113: 10,
    PSUIT0079: 43.5,
    P6972267565285: 12,
    P6943478019263: 40,
    P6950164808711: 32,
    P6950164809688: 23.73,
    P6943478023925: 86,
    P6943478018587: 66,
    P6950164801224: 18,
    P6950164801194: 34,
    P6943478013131: 52,
    P6943478021747: 101,
    P6943478016316: 62,
    P6950164809909: 17,
    Psuit00265: 58,
    P6943478030725: 198,
    P20200428: 32,
    P6950164804867: 23,
    Psuit00266: 58,
    P6943478030879: 0,
    P6943478025318:0,
    P6939219081576:0,
    P6950164805383:0,
    P6939219070501:0,
    P6939219011245:0,
    P6950164809251:0,
    P694347803037:0,
    P6943478029910:0,
    P6939219012402:0,
    P6939219080937:0,
    P6939219070587:0,
    P6943478006355:0,
};